[
  {
    "category": "Automotive",
    "brands": [
      {
        "name": "Toyota",
        "cars": [
          {
            "image": "https://www.motortrend.com/uploads/sites/5/2020/01/2020-Toyota-Camry-TRD-front-three-quarter-in-motion-2.jpg",
            "name": "Toyota Camry",
            "brand_name": "Toyota",
            "type": "Sedan",
            "price": "$25,000",
            "short_description": "The Toyota Camry is a reliable family sedan with excellent fuel efficiency.",
            "detailed_description": "The latest Toyota Camry is a testament to Toyota's commitment to excellence. With a sleek design, advanced safety features, and a comfortable interior, it's perfect for daily commuting. Its fuel-efficient engine ensures you'll go farther with every gallon. Experience the quality and reliability that Toyota is renowned for. Whether you're zipping through city streets or cruising on the highway, the Camry's refined ride and precise handling will make every journey enjoyable. With a top safety rating, you can drive with peace of mind, knowing that you and your loved ones are well-protected.",
            "rating": 4.5
          },
          {
            "image": "https://www.motortrend.com/uploads/2021/11/2022_Toyota_RAV4_XSE_001.jpg",
            "name": "Toyota RAV4",
            "brand_name": "Toyota",
            "type": "SUV",
            "price": "$28,000",
            "short_description": "The Toyota RAV4 is a versatile SUV with spacious interiors.",
            "detailed_description": "The Toyota RAV4 is your go-to choice for adventure. Its rugged design and robust all-wheel drive system make it perfect for both city living and off-road exploration. With a spacious and comfortable cabin, you'll have ample room for passengers and cargo. The latest RAV4 comes packed with advanced tech features, ensuring that you stay connected and entertained on the go. Take the road less traveled and create memories with the Toyota RAV4.",
            "rating": 4.3
          },
          {
            "image": "https://i.pinimg.com/originals/af/09/b1/af09b13f4e38effd157316f054854c0f.jpg",
            "name": "Toyota Supra",
            "brand_name": "Toyota",
            "type": "Sports Car",
            "price": "$50,000",
            "short_description": "The Toyota Supra is a legendary sports car known for its speed and agility.",
            "detailed_description": "The Toyota Supra, a legend reborn, is the epitome of high-performance sports cars. It boasts a turbocharged engine that delivers breathtaking speed and agility on the road. The Supra's sleek design is matched by its powerful performance, making it a thrilling ride for enthusiasts. This masterpiece combines cutting-edge technology with classic sports car styling. The Supra is not just a car; it's an experience, a statement, and an embodiment of Toyota's racing heritage.",
            "rating": 4.8
          },
          {
            "image": "https://i.pinimg.com/originals/ed/c7/77/edc777f7da61607246223e370af1e4f5.jpg",
            "name": "Toyota Land Cruiser",
            "brand_name": "Toyota",
            "type": "SUV",
            "price": "$85,000",
            "short_description": "The Toyota Land Cruiser is a rugged and luxurious off-road SUV.",
            "detailed_description": "The Toyota Land Cruiser stands as a testament to the marriage of rugged off-road capability and luxury. With its legendary durability, you can conquer any terrain with confidence. Inside, you'll find a lavish and spacious cabin loaded with premium materials and top-notch tech features. The Land Cruiser offers an unrivaled combination of refinement and adventure. From the concrete jungle to the untamed wilderness, it's your trusty companion on every journey.",
            "rating": 4.7
          }
        ]
      },
      {
        "name": "Ford",
        "cars": [
          {
            "image": "https://repairsmith-prod-wordpress.s3.amazonaws.com/2020/10/Ford_0007_2016-Ford-Fusion.jpg",
            "name": "Ford Fusion",
            "brand_name": "Ford",
            "type": "Sedan",
            "price": "$23,000",
            "short_description": "The Ford Fusion is a stylish and efficient sedan with advanced tech features.",
            "detailed_description": "The Ford Fusion is the epitome of a modern sedan, offering a blend of style, efficiency, and advanced technology. Its comfortable interior, cutting-edge infotainment system, and great fuel economy make it the ideal companion for your daily commute. With a sleek design and a wide range of engine options, the Fusion caters to a variety of tastes. Whether you prioritize fuel efficiency, performance, or a blend of both, the Fusion has it all.",
            "rating": 4.4
          },
          {
            "image": "https://www.carpixel.net/w/b78a420d9ab3b44fb09e3c39607526ba/ford-explorer-st-wallpaper-hd-88262.jpg",
            "name": "Ford Explorer",
            "brand_name": "Ford",
            "type": "SUV",
            "price": "$32,000",
            "short_description": "The Ford Explorer is a spacious and versatile SUV with three-row seating.",
            "detailed_description": "The Ford Explorer is the perfect family SUV, designed to accommodate your entire crew with its three-row seating and spacious cabin. Loaded with advanced safety features and driver-assist technology, it ensures a secure and comfortable ride for all passengers. Whether you're going on a road trip or navigating city streets, the Explorer's balanced performance, towing capacity, and ample cargo space have you covered.",
            "rating": 4.5
          },
          {
            "image": "https://images.wallpaperscraft.com/image/single/ford_mustang_gt_ford_side_view_123194_1920x1080.jpg",
            "name": "Ford Mustang",
            "brand_name": "Ford",
            "type": "Sports Car",
            "price": "$45,000",
            "short_description": "The Ford Mustang is an iconic American muscle car known for its power and style.",
            "detailed_description": "The Ford Mustang is an American icon, combining raw power with timeless style. It's not just a car; it's a legend on wheels. The latest Mustang continues the tradition of thrilling performance with a range of potent engines. Its aggressive design, exhilarating speed, and unmistakable roar of the V8 engine make it an enthusiast's dream. Get behind the wheel of a Ford Mustang and experience the heart-pounding sensation of American muscle.",
            "rating": 4.9
          },
          {
            "image": "https://www.carpixel.net/w/204b0a23dcc01aeff0f7540a8a9560ac/ford-f-150-raptor-supercab-wallpaper-hd-16019.jpg",
            "name": "Ford F-150 Raptor",
            "brand_name": "Ford",
            "type": "Truck",
            "price": "$55,000",
            "short_description": "The Ford F-150 Raptor is a high-performance off-road truck built for adventure.",
            "detailed_description": "The Ford F-150 Raptor is the ultimate off-road pickup, ready to conquer the toughest terrains. It's not just about off-road capability; it's about off-road dominance. With its high ground clearance, rugged suspension, and powerful engine, the Raptor is designed for adventure seekers. Tackle the desert, rocky trails, or muddy paths with ease. Inside, you'll find a comfortable cabin with the latest tech features. From daily driving to off-road escapades, the F-150 Raptor excels in every aspect.",
            "rating": 4.7
          }
        ]
      },
      {
        "name": "BMW",
        "cars": [
          {
            "image": "https://www.carpixel.net/w/a6b7805446e3debaa6fae05885dcb078/bmw-3-series-m-sport-wallpaper-hd-80464.jpg",
            "name": "BMW 3 Series",
            "brand_name": "BMW",
            "type": "Sedan",
            "price": "$40,000",
            "short_description": "The BMW 3 Series is a luxury sedan with sporty performance and advanced technology.",
            "detailed_description": "The BMW 3 Series represents the pinnacle of luxury and performance in a compact sedan. With its sporty handling, powerful engine options, and cutting-edge technology, it offers a truly dynamic driving experience. The interior is a blend of elegance and functionality, featuring high-quality materials and advanced infotainment. The 3 Series is not just a car; it's an expression of luxury and precision. Experience the thrill of driving a BMW, where every detail is meticulously crafted to perfection.",
            "rating": 4.6
          },
          {
            "image": "https://images7.alphacoders.com/962/962172.jpg",
            "name": "BMW X5",
            "brand_name": "BMW",
            "type": "SUV",
            "price": "$60,000",
            "short_description": "The BMW X5 is a premium SUV with a spacious and opulent cabin.",
            "detailed_description": "The BMW X5 defines luxury in the SUV segment. With a spacious and opulent cabin, the X5 offers a premium driving experience for you and your passengers. Its powerful engine options ensure a smooth and powerful ride. Cutting-edge technology keeps you connected and entertained. Whether you're heading for a night out in the city or a weekend adventure in the mountains, the BMW X5 provides the ideal blend of luxury and performance.",
            "rating": 4.7
          },
          {
            "image": "https://cimg2.ibsrv.net/ibimg/hgm/1920x1080-1/100/702/bmw-8-series_100702902.jpg",
            "name": "BMW M8",
            "brand_name": "BMW",
            "type": "Sports Car",
            "price": "$100,000",
            "short_description": "The BMW M8 is a high-performance sports car with breathtaking speed and style.",
            "detailed_description": "The BMW M8 is the embodiment of high-performance sports cars. Its breathtaking speed, precise handling, and striking design make it a showstopper on the road. With its handcrafted engine, the M8 delivers an unmatched level of power and performance. The cabin is a blend of luxury and technology, offering a driver-focused experience. From city streets to winding mountain roads, the BMW M8 provides a thrilling ride for those who demand the best.",
            "rating": 4.9
          },
          {
            "image": "https://www.hdcarwallpapers.com/download/2018_bmw_i8_coupe_4k-1920x1080.jpg",
            "name": "BMW i8",
            "brand_name": "BMW",
            "type": "Sports Car",
            "price": "$150,000",
            "short_description": "The BMW i8 is a hybrid sports car with futuristic looks and exceptional performance.",
            "detailed_description": "The BMW i8 is not just a car; it's a glimpse into the future of automotive engineering. With its hybrid powertrain, it seamlessly combines electric efficiency and petrol performance. Its futuristic design is matched by its quick acceleration and precise handling. The i8 offers a unique and eco-friendly approach to supercar performance, allowing you to experience sports car thrills with a clear conscience. It's a statement of innovation, blending sustainability with exhilaration.",
            "rating": 4.8
          }
        ]
      },
      {
        "name": "Mercedes-Benz",
        "cars": [
          {
            "image": "mercedes_c_class.jpg",
            "name": "Mercedes-Benz C-Class",
            "brand_name": "Mercedes-Benz",
            "type": "Sedan",
            "price": "$45,000",
            "short_description": "The Mercedes-Benz C-Class is a luxury sedan with a blend of elegance and performance.",
            "detailed_description": "The Mercedes-Benz C-Class is a masterpiece of luxury and performance, offering a unique blend of elegance and power. Its stylish interior is rich in high-quality materials, providing an inviting and comfortable space. The C-Class delivers a refined ride, precise handling, and a range of powerful engine options. It's the epitome of a luxury sedan, designed for those who demand the best. Experience the perfect harmony of performance and sophistication.",
            "rating": 4.7
          },
          {
            "image": "mercedes_gle.jpg",
            "name": "Mercedes-Benz GLE",
            "brand_name": "Mercedes-Benz",
            "type": "SUV",
            "price": "$65,000",
            "short_description": "The Mercedes-Benz GLE is a premium SUV with cutting-edge technology and a comfortable ride.",
            "detailed_description": "The Mercedes-Benz GLE offers a premium SUV experience, blending cutting-edge technology with a comfortable ride. Its spacious cabin is designed for both luxury and functionality, providing room for the whole family. With advanced safety features and a smooth, refined drive, the GLE ensures a secure and enjoyable journey. It's a statement of modern luxury, making every ride an experience worth savoring.",
            "rating": 4.8
          },
          {
            "image": "mercedes_amg_gt.jpg",
            "name": "Mercedes-AMG GT",
            "brand_name": "Mercedes-Benz",
            "type": "Sports Car",
            "price": "$140,000",
            "short_description": "The Mercedes-AMG GT is a high-performance sports car with stunning looks and thrilling power.",
            "detailed_description": "The Mercedes-AMG GT is not just a sports car; it's an experience that sets your heart racing. Its handcrafted engine produces breathtaking power and acceleration. The GT's captivating design, low-slung profile, and premium interior make it a work of art. With exhilarating speed and agile handling, it offers an adrenaline-pumping ride. The AMG GT is a symbol of Mercedes-Benz's commitment to high-performance vehicles.",
            "rating": 4.9
          },
          {
            "image": "mercedes_sls_amg.jpg",
            "name": "Mercedes-Benz SLS AMG",
            "brand_name": "Mercedes-Benz",
            "type": "Sports Car",
            "price": "$250,000",
            "short_description": "The Mercedes-Benz SLS AMG is a supercar with gullwing doors and extraordinary performance.",
            "detailed_description": "The Mercedes-Benz SLS AMG is a supercar that defines the zenith of automotive engineering. Its distinctive gullwing doors and striking design turn heads wherever it goes. With a handcrafted engine that produces explosive power, the SLS AMG offers extraordinary acceleration and top speeds. Inside, you'll find a luxurious interior with premium materials and cutting-edge technology. It's a work of art on wheels, a limited edition masterpiece that captures the essence of pure performance and luxury.",
            "rating": 4.9
          }
        ]
      },
      {
        "name": "Honda",
        "cars": [
          {
            "image": "honda_civic.jpg",
            "name": "Honda Civic",
            "brand_name": "Honda",
            "type": "Sedan",
            "price": "$23,000",
            "short_description": "The Honda Civic is a compact sedan known for its reliability and fuel efficiency.",
            "detailed_description": "The latest Honda Civic offers a sleek design, comfortable interior, and advanced safety features, making it a top choice for daily commuting. With a wide range of trims and powertrains, the Civic caters to a variety of preferences. Its proven reliability and impressive fuel efficiency ensure a hassle-free ownership experience. Get behind the wheel of the Civic and discover why it's a perennial favorite among compact sedans.",
            "rating": 4.4
          },
          {
            "image": "honda_cr-v.jpg",
            "name": "Honda CR-V",
            "brand_name": "Honda",
            "type": "SUV",
            "price": "$28,000",
            "short_description": "The Honda CR-V is a versatile SUV with spacious interiors and a reputation for reliability.",
            "detailed_description": "The Honda CR-V is designed for families, offering a roomy cabin, excellent cargo space, and a comfortable ride. With advanced safety features, the CR-V keeps you and your loved ones safe on every journey. Its versatile nature ensures you can handle everything from grocery runs to cross-country road trips with ease. The CR-V is the perfect companion for those who require both functionality and style.",
            "rating": 4.5
          },
          {
            "image": "honda_accord.jpg",
            "name": "Honda Accord",
            "brand_name": "Honda",
            "type": "Sedan",
            "price": "$27,000",
            "short_description": "The Honda Accord is a midsize sedan with a comfortable and well-appointed interior.",
            "detailed_description": "The Honda Accord strikes the perfect balance between comfort and style. With its spacious and well-appointed interior, it provides a serene driving experience. The Accord offers a range of efficient and powerful engines, ensuring there's an option for every driver. With advanced safety technology and a reputation for reliability, it's a smart choice for those who seek a blend of practicality and sophistication.",
            "rating": 4.3
          },
          {
            "image": "honda_crv_hybrid.jpg",
            "name": "Honda CR-V Hybrid",
            "brand_name": "Honda",
            "type": "Hybrid SUV",
            "price": "$32,000",
            "short_description": "The Honda CR-V Hybrid is an eco-friendly SUV with impressive fuel economy.",
            "detailed_description": "The Honda CR-V Hybrid delivers on both environmental and practical fronts. With impressive fuel economy, it's a cost-effective and eco-conscious choice. The CR-V Hybrid combines the versatility of the standard CR-V with a hybrid powertrain, offering excellent efficiency and a comfortable ride. Its spacious cabin ensures you can carry both passengers and cargo, making it ideal for family adventures. Embrace the future of SUVs with the Honda CR-V Hybrid.",
            "rating": 4.7
          }
        ]
      },
      {
        "name": "Tesla",
        "cars": [
          {
            "image": "tesla_model_3.jpg",
            "name": "Tesla Model 3",
            "brand_name": "Tesla",
            "type": "Electric Sedan",
            "price": "$40,000",
            "short_description": "The Tesla Model 3 is an electric sedan with advanced self-driving capabilities.",
            "detailed_description": "The Tesla Model 3 is a revolutionary electric sedan, setting new standards for the automotive industry. With advanced self-driving capabilities, it provides a glimpse into the future of transportation. The Model 3 offers impressive electric range, Autopilot, and a minimalist interior design, making it a leader in electric mobility. It's not just a car; it's a symbol of sustainability, innovation, and a cleaner, smarter way to travel.",
            "rating": 4.8
          },
          {
            "image": "tesla_model_y.jpg",
            "name": "Tesla Model Y",
            "brand_name": "Tesla",
            "type": "Electric SUV",
            "price": "$50,000",
            "short_description": "The Tesla Model Y is a versatile electric SUV with spacious interiors.",
            "detailed_description": "The Tesla Model Y is designed for versatility and sustainability. With spacious interiors, seating for up to seven, and the benefits of electric propulsion, it's a game-changer for eco-conscious families. The Model Y provides ample cargo space, advanced technology, and a comfortable cabin, all in one package. Join the electric revolution with the Tesla Model Y and experience a greener and smarter way of getting around.",
            "rating": 4.7
          },
          {
            "image": "tesla_model_s.jpg",
            "name": "Tesla Model S",
            "brand_name": "Tesla",
            "type": "Electric Sedan",
            "price": "$80,000",
            "short_description": "The Tesla Model S is a luxury electric sedan with incredible acceleration and range.",
            "detailed_description": "The Tesla Model S redefines luxury with its electric performance and spacious cabin. It's all about acceleration, and the Model S delivers with jaw-dropping speed. With high-performance variants, a minimalist interior, and cutting-edge technology, it sets the standard for electric luxury. Its impressive range and powerful electric motors make it a joy to drive. Discover a world of elegance and innovation with the Tesla Model S.",
            "rating": 4.9
          },
          {
            "image": "tesla_model_x.jpg",
            "name": "Tesla Model X",
            "brand_name": "Tesla",
            "type": "Electric SUV",
            "price": "$90,000",
            "short_description": "The Tesla Model X is an electric SUV with distinctive Falcon Wing doors and exceptional performance.",
            "detailed_description": "The Tesla Model X is not just an SUV; it's a statement of innovation and performance. Its distinctive Falcon Wing doors, spacious interior, and advanced tech features create a unique driving experience. With impressive range, all-wheel drive, and quick acceleration, it's an electric SUV that combines style with substance. Embrace the future of transportation with the Tesla Model X.",
            "rating": 4.8
          }
        ]
      }
    ]
  }
]
